In [1]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

In [3]:
ser = Series(np.arange(3),index=['a','b','c'])
ser1 = 2*ser
ser1

a    0
b    2
c    4
dtype: int64

In [5]:
ser1['b']

2

In [6]:
ser1[1]

2

In [7]:
ser1[0:3]

a    0
b    2
c    4
dtype: int64

In [9]:
ser1[['a','c']]

a    0
c    4
dtype: int64

In [10]:
ser1[ser1>3]

c    4
dtype: int64

In [13]:
ser1[ser1>3] = 10
ser1

a     0
b     2
c    10
dtype: int64

In [14]:
dframe = DataFrame(np.arange(25).reshape(5,5),index=['a','b','c','d','e'],columns=['one','two','three', 'four','five'])
dframe

   one  two  three  four  five
a    0    1      2     3     4
b    5    6      7     8     9
c   10   11     12    13    14
d   15   16     17    18    19
e   20   21     22    23    24

In [16]:
dframe['one']

a     0
b     5
c    10
d    15
e    20
Name: one, dtype: int64

In [18]:
dframe[['two','four']]

   two  four
a    1     3
b    6     8
c   11    13
d   16    18
e   21    23

In [21]:
dframe[dframe['three']>10]

   one  two  three  four  five
c   10   11     12    13    14
d   15   16     17    18    19
e   20   21     22    23    24

In [22]:
dframe > 20

     one    two  three   four   five
a  False  False  False  False  False
b  False  False  False  False  False
c  False  False  False  False  False
d  False  False  False  False  False
e  False   True   True   True   True